OpenFOAM-5/chapter1/cavityInPipe/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (4.5 -1 0)
    (5.5 -1 0)

    (0 0 0)
    (4.5 0 0)
    (5.5 0 0)
    (10  0 0)

    (0 2 0)
    (4.5 2 0)
    (5.5 2 0)
    (10  2 0)

//front points
    (4.5 -1 0.1)
    (5.5 -1 0.1)

    (0 0 0.1)
    (4.5 0 0.1)
    (5.5 0 0.1)
    (10  0 0.1)

    (0 2 0.1)
    (4.5 2 0.1)
    (5.5 2 0.1)
    (10  2 0.1)
);

blocks
(
    hex (0 1 4 3  10 11 14 13) (4 4 1) simpleGrading (1 1 1)
    hex (2 3 7 6  12 13 17 16) (18 8 1) simpleGrading (1 1 1)
    hex (3 4 8 7  13 14 18 17) (4 8 1) simpleGrading (1 1 1)
    hex (4 5 9 8 14 15 19 18) (18 8 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
	type	patch;
	faces
	(
	    (2 6 16 12)
        );
    }

    outlet
    {
	type	patch;
	faces
	(
	    (5 9 19 15)
        );
    }

    fixedWalls
    {
        type wall;
        faces
        (
            (0 1 11 10)
            (1 4 14 11)
            (0 3 13 10)
            (2 3 13 12)
            (6 7 17 16)
	    (7 8 18 17)
            (8 9 19 18)
            (4 5 15 14)
        );
    }
    frontAndBack
    {
        type empty;
        faces
        (
            (0 1 4 3)
            (10 11 14 13)
            (3 4 8 7)
            (13 14 18 17)
            (4 5 9 8)
            (14 15 19 18)
            (2 3 7 6)
            (12 13 17 16)
        );
    }
);

mergePatchPairs
(

);

// ************************************************************************* //
